ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5x/TARGET_NRF52/spi_api.c
#if DEVICE_SPISLAVE

/** Check if a value is available to read
 *
 * Parameter  obj The SPI peripheral to check
 * Return     non-zero if a value is available
 */
int spi_slave_receive(spi_t *obj)
{
    return 0;
}

/** Get a received value out of the SPI receive buffer in slave mode
 *
 * Blocks until a value is available
 * Parameter  obj The SPI peripheral to read
 * Return     The value received
 */
int spi_slave_read(spi_t *obj)
{
    return 0;
}

/** Write a value to the SPI peripheral in slave mode
 *
 * Blocks until the SPI peripheral can be written to
 * Parameter  obj   The SPI peripheral to write
 * Parameter  value The value to write
 */
void spi_slave_write(spi_t *obj, int value)
{
    return;
}

#endif

#if DEVICE_SPI_ASYNCH

/***
 *                                               _____ _____
 *         /\                              /\   |  __ \_   _|
 *        /  \   ___ _   _ _ __   ___     /  \  | |__) || |
 *       / /\ \ / __| | | | '_ \ / __|   / /\ \ |  ___/ | |
 *      / ____ \\__ \ |_| | | | | (__   / ____ \| |    _| |_
 *     /_/    \_\___/\__, |_| |_|\___| /_/    \_\_|   |_____|
 *                    __/ |
 *                   |___/
 */

static ret_code_t spi_master_transfer_async_continue(spi_t *obj)
{
#if NRFX_CHECK(NRFX_SPIM_ENABLED)
    nrfx_spim_xfer_desc_t desc;
#elif NRFX_CHECK(NRFX_SPI_ENABLED)
    nrfx_spi_xfer_desc_t desc;
#endif
    /* Remaining data to be transferred. */
    size_t tx_length = obj->tx_buff.length - obj->tx_buff.pos;
    size_t rx_length = obj->rx_buff.length - obj->rx_buff.pos;

    /* Cap TX length to 255 bytes. */
    if (tx_length > 255) {
        tx_length = 255;
    }

    /* Cap RX length to 255 bytes. */
    if (rx_length > 255) {
        rx_length = 255;
    }

    desc.p_tx_buffer = ((const uint8_t *)(obj->tx_buff.buffer) + obj->tx_buff.pos);
    desc.p_rx_buffer = ((uint8_t *)(obj->rx_buff.buffer) + obj->rx_buff.pos);
    desc.tx_length = tx_length;
    desc.rx_length = rx_length;

#if NRFX_CHECK(NRFX_SPIM_ENABLED)
    ret_code_t result = nrfx_spim_xfer(&nordic_nrf5_spim_instance[obj->spi.instance], &desc, 0);
#elif NRFX_CHECK(NRFX_SPI_ENABLED)
    ret_code_t result = nrfx_spi_xfer(&nordic_nrf5_spi_instance[obj->spi.instance], &desc, 0);
#endif
    return result;
}

/* Callback function for driver calls. This is called from ISR context. */
#if NRFX_CHECK(NRFX_SPIM_ENABLED)
static void nordic_nrf5_spi_event_handler(nrfx_spim_evt_t const *p_event, void *p_context)
#elif NRFX_CHECK(NRFX_SPI_ENABLED)
static void nordic_nrf5_spi_event_handler(nrfx_spi_evt_t const *p_event, void *p_context)
#endif
{
    // Only safe to use with mbed-printf.
    //DEBUG_PRINTF("nordic_nrf5_twi_event_handler: %d %p\r\n", p_event->type, p_context);

    bool signal_complete = false;
    bool signal_error = false;

    spi_t *obj = (spi_t *) p_context;
    struct spi_s *spi_inst = &obj->spi;

#if NRFX_CHECK(NRFX_SPIM_ENABLED)
    if (p_event->type == NRFX_SPIM_EVENT_DONE) {
#elif NRFX_CHECK(NRFX_SPI_ENABLED)
    if (p_event->type == NRFX_SPI_EVENT_DONE) {
#endif

        /* Update buffers with new positions. */
        obj->tx_buff.pos += p_event->xfer_desc.tx_length;
        obj->rx_buff.pos += p_event->xfer_desc.rx_length;

        /* Setup a new transfer if more data is pending. */
        if ((obj->tx_buff.pos < obj->tx_buff.length) || (obj->rx_buff.pos < obj->tx_buff.length)) {

            /* Initiate SPI transfer. */
            ret_code_t result = spi_master_transfer_async_continue(obj);

            /* Abort if transfer wasn't accepted. */
            if (result != NRFX_SUCCESS) {

                /* Signal callback handler that transfer failed. */
                signal_error = true;
            }

        } else {

            /* Signal callback handler that transfer is complete. */
            signal_complete = true;
        }
    } else {

        /* Unexpected event, signal callback handler that transfer failed. */
        signal_error = true;
    }

    /* Transfer complete, signal success if mask is set.*/
    if (signal_complete) {

        /* Signal success if event mask matches and event handler is set. */
        if ((spi_inst->mask & SPI_EVENT_COMPLETE) && spi_inst->handler) {

            /* Cast handler to callback function pointer. */
            void (*callback)(void) = (void (*)(void)) spi_inst->handler;

            /* Reset object. */
            spi_inst->handler = 0;
            spi_inst->update = true;

            /* Store event value so it can be read back. */
            spi_inst->event = SPI_EVENT_COMPLETE;

            /* Signal callback handler. */
            callback();
        }

        /* Transfer failed, signal error if mask is set. */
    } else if (signal_error) {

        /* Signal error if event mask matches and event handler is set. */
        if ((spi_inst->mask & SPI_EVENT_ERROR) && spi_inst->handler) {

            /* Cast handler to callback function pointer. */
            void (*callback)(void) = (void (*)(void)) spi_inst->handler;

            /* Reset object. */
            spi_inst->handler = 0;
            spi_inst->update = true;

            /* Store event value so it can be read back. */
            spi_inst->event = SPI_EVENT_ERROR;

            /* Signal callback handler. */
            callback();
        }
    }

    /* Transfer completed one way or another. Set chip select manually if defined. */
    if (signal_complete || signal_error) {

        if (spi_inst->cs != NC) {
            nrf_gpio_pin_set(spi_inst->cs);
        }
    }
}

/** Begin the SPI transfer. Buffer pointers and lengths are specified in tx_buff and rx_buff
 *
 * Parameter  obj       The SPI object that holds the transfer information
 * Parameter  tx        The transmit buffer
 * Parameter  tx_length The number of bytes to transmit
 * Parameter  rx        The receive buffer
 * Parameter  rx_length The number of bytes to receive
 * Parameter  bit_width The bit width of buffer words
 * Parameter  event     The logical OR of events to be registered
 * Parameter  handler   SPI interrupt handler
 * Parameter  hint      A suggestion for how to use DMA with this transfer
 */
void spi_master_transfer(spi_t *obj,
                         const void *tx,
                         size_t tx_length,
                         void *rx,
                         size_t rx_length,
                         uint8_t bit_width,
                         uint32_t handler,
                         uint32_t mask,
                         DMAUsage hint)
{
    /* SPI peripheral only supports 8 bit transfers. */
    MBED_ASSERT(bit_width == 8);

    /* Setup buffers for transfer. */
    struct buffer_s *buffer_pointer;

